from decimal import Decimal


DEGRADATION_ZONE_WIDTH = 3
DEGRADATION_MIN_COEFFICIENT = 0.3
DEGRADATION_MAX_COEFFICIENT = 1
# отсекаем варианты в которых суммарный трафик по сектору
# на N процентов меньше чем трафик по всем азимутам
TRAFFIC_TRESHOLD = Decimal('20')

# Все конфигурации для перебора
CONFIGURATIONS = {
    "1) 120°(2x60°)": (60, 60,),
    "2) 60°(2x30°)": (30, 30,),
    "3) 40°(2x20°)": (20, 20,),
    "4) 120°(3x40°)": (40, 40, 40,),
    "5) 60°(3x20°)": (20, 20, 20,),
    # "60+40+60": (60, 40, 60,),
    # "360°(3x120°)": (120, 120, 120,),
    #"60°(1x60°)": (60, ),
}
